# language: zh-CN
@ModelRepositoryTest
功能: 验证模型仓库的WebUI和功能

  场景大纲: 模型仓库场景-导入
    假如 打开浏览器
    当 执行测试场景："<scenario>"
    那么 关闭浏览器
    例子:
      | scenario  |
      | 模型仓库 - 导入 |

  场景大纲: 模型仓库场景-查看已通过模型
    假如 打开浏览器
    当 执行测试场景："<scenario>"
    那么 关闭浏览器
    例子:
      | scenario       |
      | 模型仓库 - 查看已通过模型 |

  场景大纲: 模型仓库场景-查看待审核模型
    假如 打开浏览器
    当 执行测试场景："<scenario>"
    那么 关闭浏览器
    例子:
      | scenario       |
      | 模型仓库 - 查看待审核模型 |

  场景大纲: 模型仓库场景-查看未通过模型
    假如 打开浏览器
    当 执行测试场景："<scenario>"
    那么 关闭浏览器
    例子:
      | scenario       |
      | 模型仓库 - 查看未通过模型 |

  场景大纲: 模型仓库场景-移到未通过
    假如 打开浏览器
    当 执行测试场景："<scenario>"
    那么 关闭浏览器
    例子:
      | scenario     |
      | 模型仓库 - 移到未通过 |

  场景大纲: 模型仓库场景-移到通过
    假如 打开浏览器
    当 执行测试场景："<scenario>"
    那么 关闭浏览器
    例子:
      | scenario    |
      | 模型仓库 - 移到通过 |

  场景大纲: 模型仓库场景-查看服务
    假如 打开浏览器
    当 执行测试场景："<scenario>"
    那么 关闭浏览器
    例子:
      | scenario    |
      | 模型仓库 - 查看服务 |

  场景大纲: 模型仓库场景-编缉服务
    假如 打开浏览器
    当 执行测试场景："<scenario>"
    那么 关闭浏览器
    例子:
      | scenario    |
      | 模型仓库 - 编缉服务 |

  场景大纲: 模型仓库场景-移到未通过（从更多中）
    假如 打开浏览器
    当 执行测试场景："<scenario>"
    那么 关闭浏览器
    例子:
      | scenario           |
      | 模型仓库 - 移到未通过（从更多中） |

  场景大纲: 模型仓库场景-移到通过（从更多中）
    假如 打开浏览器
    当 执行测试场景："<scenario>"
    那么 关闭浏览器
    例子:
      | scenario          |
      | 模型仓库 - 移到通过（从更多中） |

  场景大纲: 模型仓库场景-导出模型
    假如 打开浏览器
    当 执行测试场景："<scenario>"
    那么 关闭浏览器
    例子:
      | scenario    |
      | 模型仓库 - 导出模型 |

  场景大纲: 模型仓库场景-导出全部模型
    假如 打开浏览器
    当 执行测试场景："<scenario>"
    那么 关闭浏览器
    例子:
      | scenario      |
      | 模型仓库 - 导出全部模型 |

  场景大纲: 模型仓库场景-查看API
    假如 打开浏览器
    当 执行测试场景："<scenario>"
    那么 关闭浏览器
    例子:
      | scenario     |
      | 模型仓库 - 查看API |

  场景大纲: 模型仓库场景-调试
    假如 打开浏览器
    当 执行测试场景："<scenario>"
    那么 关闭浏览器
    例子:
      | scenario  |
      | 模型仓库 - 调试 |

  场景大纲: 模型仓库场景-查看日志
    假如 打开浏览器
    当 执行测试场景："<scenario>"
    那么 关闭浏览器
    例子:
      | scenario    |
      | 模型仓库 - 查看日志 |

  场景大纲: 模型仓库场景-部署
    假如 打开浏览器
    当 执行测试场景："<scenario>"
    那么 关闭浏览器
    例子:
      | scenario  |
      | 模型仓库 - 部署 |

  场景大纲: 模型仓库场景-上线
    假如 打开浏览器
    当 执行测试场景："<scenario>"
    那么 关闭浏览器
    例子:
      | scenario  |
      | 模型仓库 - 上线 |

  场景大纲: 模型仓库场景-下线
    假如 打开浏览器
    当 执行测试场景："<scenario>"
    那么 关闭浏览器
    例子:
      | scenario  |
      | 模型仓库 - 下线 |

  场景大纲: 模型仓库场景-取消部署
    假如 打开浏览器
    当 执行测试场景："<scenario>"
    那么 关闭浏览器
    例子:
      | scenario    |
      | 模型仓库 - 取消部署 |

  场景大纲: 模型仓库场景-设置列
    假如 打开浏览器
    当 执行测试场景："<scenario>"
    那么 关闭浏览器
    例子:
      | scenario   |
      | 模型仓库 - 设置列 |